# coding: UTF-8

no_input = input('请输入想随机的数序:')  # 用正则表达式提示输入数据
no = round(float(no_input))  # 由于input函数输入的是str字符串型，必须转换为整数型才能进行随机运算，直接用int转换的话提示错误，所以先用float转换为浮点型，然后再用round取整去小数点
# --------------------------------以上为获取输入数序-----------------------------

l_set = [int(item) for item in str(no)]
print(l_set)  # 调试输入是否生成列表
# --------------------------------以上将输入数序拆开成列表------------------------

no_l = len(l_set) + 1  # 获取列表长度用于拆分列表,+1用于后面拆长度为列表时从1开始取值
print(no_l)  # 调试列表长度是否生成列表
l_no = [i * 10 for i in range(1, no_l)]  # 将长度生成列表并×10变10位数列表
print(l_no)  # 调试长度列表是否×10变列表
# --------------------------------以上获取拆开的列表长度生成长度列表---------------
#  l_no_l = [i for i in range(1, l_set[])]
#  print(l_no + l_no_l)
ok = []
for x in l_set:  # 依次提取列表内的数值
    print(x)  # 调试显示每次从列表内提取的数值
    k = [i + 1 for i in range(x)]  # 将从列表提取出的数值迭代
    ok.append(k)  # 将迭代生成的列表分别存入ok列表中
print(ok)  # 调试显示迭代后的列表合集
# 下面准备将l_no列表内每个数对应ok列表内的列表相加

# --------------------------------以上将生成的列表合成一个全体列表-----------------

# --------------------------------从全体列表里随机出一个数字，并与“存在集合”比对，不在“存在集合”里的话就存入并输出，已存在的话重新随机
